RAR/openevse_esp32_firmware/src/lvgl_tft/lvgl_panel.cpp
// src/lvgl_tft/lvgl_panel.cpp — see lvgl_panel.h.
#ifdef ENABLE_SCREEN_LVGL_TFT

#include <Arduino.h>
#include <lvgl.h>
#if defined(TFT_SPI_DRIVE_CAP) && !defined(EPOXY_DUINO)
#include <driver/gpio.h>
#endif

#if defined(EPOXY_DUINO)
#include <dlfcn.h>
#include <stdlib.h>
#include <string.h>
#if __has_include(<SDL2/SDL.h>)
#include <SDL2/SDL.h>
#define LVGL_PANEL_HAS_SDL 1
#elif __has_include(<SDL.h>)
#include <SDL.h>
#define LVGL_PANEL_HAS_SDL 1
#else
#define LVGL_PANEL_HAS_SDL 0
#endif
#else
#include <TFT_eSPI.h>
#include <esp_heap_caps.h>
#endif

#include "lvgl_panel.h"
#include "backlight.h"

// The ILI9488 forces TFT_eSPI's SPI_18BIT_DRIVER, which disables ESP32_DMA
// (DMA only supports 16-bit pushes). So there is no DMA path on this panel —
// the flush always uses blocking pushPixels.
#if defined(ESP32_DMA)
#warning "ESP32_DMA unexpectedly available on ILI9488 — still using blocking pushPixels"
#endif

// Backlight PWM. RGB-LED PWM (LedManagerTask) uses LEDC channels 1..3 and WS2812
// uses RMT, so channel 0 is free (relevant only to the 2.x ledcAttachPin path;
// core 3.x's ledcAttach allocates a channel itself).
#ifndef LCD_BL_PWM_FREQ
#define LCD_BL_PWM_FREQ 5000
#endif
#ifndef LCD_BL_PWM_RES
#define LCD_BL_PWM_RES 8
#endif
#ifndef LCD_BL_LEDC_CHANNEL
#define LCD_BL_LEDC_CHANNEL 0
#endif

static bool bl_ready = false;

// Landscape: native panel is 320x480, rotated to 480x320.
static const uint16_t SCREEN_W = TFT_HEIGHT; // 480
static const uint16_t SCREEN_H = TFT_WIDTH;  // 320

// ONE partial buffer in INTERNAL DRAM.
//
// 16 lines on the stock board: at 32 this took a 30KB contiguous block at boot
// out of a heap with only ~60KB free; instrumentation on hardware showed the
// largest allocatable block down at 11KB while total free sat flat at ~60KB.
// Halving costs twice as many flush calls for the same total pixels -- small
// next to the blocking SPI write itself -- and returns 15KB of contiguous DRAM.
// openevse_s3_lcd overrides DRAW_BUF_LINES=32 from its env (its internal heap is
// not under the same pressure because the network stack lives in PSRAM).
//
// Single-buffered because of the TFT_eSPI boundary noted above, not because of
// anything about the ILI9488 or the S3: SPI_18BIT_DRIVER compiles the library's
// whole DMA subsystem out (Processors/TFT_eSPI_ESP32.h -- ESP32_DMA is only defined
// `#if !defined(TFT_PARALLEL_8_BIT) && !defined(SPI_18BIT_DRIVER)`), and
// pushPixelsDMA() is hardwired to `trans.length = len * 16` regardless, while this
// panel's path writes 3 bytes/pixel. DMA here would clock garbage into the panel.
// So flush_cb blocks the CPU, and a second buffer could never overlap a flush.
//
// Internal DRAM, and on PSRAM boards (openevse_s3_lcd) that is enforced rather than
// assumed -- see the note at the heap_caps_malloc() call. PSRAM is not idle on those
// boards; mbedTLS and the LVGL object pool are routed there. What it must not hold is
// this buffer, which the CPU reads. docs/hardware/esp32-s3-lcd.md has the detail.
//
// This also fixes the wire format: 18 bpp, with a CPU-side RGB565->RGB666 conversion
// on every pixel. If the display link ever becomes the bottleneck, the fix is to port
// this layer to esp_lcd (esp_lcd_ili9488 does the conversion AND DMA), not to patch
// TFT_eSPI -- dmaHAL is private and initDMA() is compiled out, so it cannot be done
// from the app side.
//
// !! THIS FILE IS SHARED WITH SHIPPED HARDWARE. !!
// openevse_wifi_tft_v1 and openevse_s3_lcd both pull in lvgl_tft_renderer_flags;
// there is no separate S3 panel layer. The constraint above is identical on both
// (SPI_18BIT_DRIVER follows ILI9488_DRIVER, not the chip), so a DMA rework would pay
// off on the stock board too -- but it must be conditioned on the board and proven on
// the S3 first: the stock board has no PSRAM to stage a second buffer in, only ~320 KB
// of internal heap already shared with WiFi and TLS, and it is in the field.
// Treat a clock bump separately from the DMA rework. 80 MHz is available on the stock
// board in principle (its TFT pins are the ESP32-classic HSPI IO_MUX set, so it also
// bypasses the GPIO matrix), but that board is the QD354801 direct-solder part while
// the S3 is an ER-TFT035-6 on FPC through a ZIF -- different trace lengths, different
// flex path. A clean 80 MHz result on one is not evidence for the other, and on
// shipped units there is no series termination to add and nothing to recall.
#ifndef DRAW_BUF_LINES
#define DRAW_BUF_LINES 16
#endif
static const uint32_t DRAW_BUF_PIXELS = SCREEN_W * DRAW_BUF_LINES; // 480*16 = 7680 px (~15 KB)

static lv_disp_draw_buf_t draw_buf;
static lv_disp_drv_t disp_drv;
static lv_color_t *buf1 = nullptr;

#if defined(EPOXY_DUINO)
static lv_color_t *host_fb = nullptr;
static LvglPanelDisplayMode display_mode = LVGL_PANEL_DISPLAY_HEADLESS;

#if LVGL_PANEL_HAS_SDL
struct SdlApi {
  void *handle = nullptr;
  int (*Init)(uint32_t flags) = nullptr;
  void (*Quit)(void) = nullptr;
  const char *(*GetError)(void) = nullptr;
  SDL_Window *(*CreateWindow)(const char *title, int x, int y, int w, int h, uint32_t flags) = nullptr;
  SDL_Renderer *(*CreateRenderer)(SDL_Window *window, int index, uint32_t flags) = nullptr;
  SDL_Texture *(*CreateTexture)(SDL_Renderer *renderer, uint32_t format, int access, int w, int h) = nullptr;
  void (*DestroyTexture)(SDL_Texture *texture) = nullptr;
  void (*DestroyRenderer)(SDL_Renderer *renderer) = nullptr;
  void (*DestroyWindow)(SDL_Window *window) = nullptr;
  int (*UpdateTexture)(SDL_Texture *texture, const SDL_Rect *rect, const void *pixels, int pitch) = nullptr;
  int (*RenderClear)(SDL_Renderer *renderer) = nullptr;
  int (*RenderCopy)(SDL_Renderer *renderer, SDL_Texture *texture, const SDL_Rect *srcrect, const SDL_Rect *dstrect) = nullptr;
  void (*RenderPresent)(SDL_Renderer *renderer) = nullptr;
  int (*PollEvent)(SDL_Event *event) = nullptr;
};

struct SdlWindowState {
  SDL_Window *window = nullptr;
  SDL_Renderer *renderer = nullptr;
  SDL_Texture *texture = nullptr;
  bool dirty = false;
};

static SdlApi sdl;
static SdlWindowState sdl_window;
#endif

static void lvgl_panel_cleanup_host_allocations()
{
  if(host_fb != nullptr) {
    free(host_fb);
    host_fb = nullptr;
  }
  if(buf1 != nullptr) {
    free(buf1);
    buf1 = nullptr;
  }
}

#if LVGL_PANEL_HAS_SDL
static void unload_sdl()
{
  if(sdl_window.texture && sdl.DestroyTexture) {
    sdl.DestroyTexture(sdl_window.texture);
  }
  if(sdl_window.renderer && sdl.DestroyRenderer) {
    sdl.DestroyRenderer(sdl_window.renderer);
  }
  if(sdl_window.window && sdl.DestroyWindow) {
    sdl.DestroyWindow(sdl_window.window);
  }
  if(sdl.Quit) {
    sdl.Quit();
  }
  if(sdl.handle) {
    dlclose(sdl.handle);
  }

