RAR/openevse_esp32_firmware/src/lvgl_tft/lvgl_panel.cpp
  sdl_window = {};
  sdl = {};
}

static bool load_symbol(void **target, const char *name)
{
  *target = dlsym(sdl.handle, name);
  return *target != nullptr;
}

static bool load_sdl()
{
  if(sdl.handle != nullptr) {
    return true;
  }

  static const char *const names[] = {
#if defined(_WIN32)
    "SDL2.dll",
#elif defined(__APPLE__)
    "libSDL2.dylib",
    "SDL2.framework/SDL2",
#else
    "libSDL2-2.0.so.0",
    "libSDL2.so",
#endif
  };

  for(size_t i = 0; i < sizeof(names) / sizeof(names[0]); i++) {
    sdl.handle = dlopen(names[i], RTLD_NOW | RTLD_LOCAL);
    if(sdl.handle != nullptr) {
      break;
    }
  }

  if(sdl.handle == nullptr) {
    return false;
  }

  if(!load_symbol((void **)&sdl.Init, "SDL_Init") ||
     !load_symbol((void **)&sdl.Quit, "SDL_Quit") ||
     !load_symbol((void **)&sdl.GetError, "SDL_GetError") ||
     !load_symbol((void **)&sdl.CreateWindow, "SDL_CreateWindow") ||
     !load_symbol((void **)&sdl.CreateRenderer, "SDL_CreateRenderer") ||
     !load_symbol((void **)&sdl.CreateTexture, "SDL_CreateTexture") ||
     !load_symbol((void **)&sdl.DestroyTexture, "SDL_DestroyTexture") ||
     !load_symbol((void **)&sdl.DestroyRenderer, "SDL_DestroyRenderer") ||
     !load_symbol((void **)&sdl.DestroyWindow, "SDL_DestroyWindow") ||
     !load_symbol((void **)&sdl.UpdateTexture, "SDL_UpdateTexture") ||
     !load_symbol((void **)&sdl.RenderClear, "SDL_RenderClear") ||
     !load_symbol((void **)&sdl.RenderCopy, "SDL_RenderCopy") ||
     !load_symbol((void **)&sdl.RenderPresent, "SDL_RenderPresent") ||
     !load_symbol((void **)&sdl.PollEvent, "SDL_PollEvent")) {
    unload_sdl();
    return false;
  }

  return true;
}

static bool sdl_window_begin()
{
  if(display_mode != LVGL_PANEL_DISPLAY_WINDOW) {
    return true;
  }

  if(!load_sdl()) {
    Serial.println("[panel] SDL2 runtime unavailable for window display mode; install SDL2 to enable it");
    return false;
  }

  if(sdl.Init(SDL_INIT_VIDEO) != 0) {
    Serial.printf("[panel] SDL_Init failed: %s\n", sdl.GetError ? sdl.GetError() : "unknown");
    unload_sdl();
    return false;
  }

  sdl_window.window = sdl.CreateWindow("OpenEVSE LVGL",
                                       SDL_WINDOWPOS_CENTERED,
                                       SDL_WINDOWPOS_CENTERED,
                                       SCREEN_W,
                                       SCREEN_H,
                                       SDL_WINDOW_SHOWN);
  if(sdl_window.window == nullptr) {
    Serial.printf("[panel] SDL_CreateWindow failed: %s\n", sdl.GetError ? sdl.GetError() : "unknown");
    unload_sdl();
    return false;
  }

  static const uint32_t renderer_flags[] = {
    SDL_RENDERER_ACCELERATED | SDL_RENDERER_PRESENTVSYNC,
    SDL_RENDERER_ACCELERATED,
    SDL_RENDERER_SOFTWARE,
    0
  };

  for(size_t i = 0; i < sizeof(renderer_flags) / sizeof(renderer_flags[0]); i++) {
    sdl_window.renderer = sdl.CreateRenderer(sdl_window.window, -1, renderer_flags[i]);
    if(sdl_window.renderer != nullptr) {
      break;
    }
  }

  if(sdl_window.renderer == nullptr) {
    Serial.printf("[panel] SDL_CreateRenderer failed: %s\n", sdl.GetError ? sdl.GetError() : "unknown");
    unload_sdl();
    return false;
  }

  sdl_window.texture = sdl.CreateTexture(sdl_window.renderer,
                                         SDL_PIXELFORMAT_RGB565,
                                         SDL_TEXTUREACCESS_STREAMING,
                                         SCREEN_W,
                                         SCREEN_H);
  if(sdl_window.texture == nullptr) {
    Serial.printf("[panel] SDL_CreateTexture failed: %s\n", sdl.GetError ? sdl.GetError() : "unknown");
    unload_sdl();
    return false;
  }

  sdl_window.dirty = true;
  return true;
}
#endif

static bool lvgl_panel_prepare_begin(size_t buf_bytes)
{
  lv_init();

  buf1 = (lv_color_t *)malloc(buf_bytes);
  if(buf1 == nullptr) {
    Serial.printf("[panel] FATAL: draw-buffer alloc failed (%u B host heap)\n",
                  (unsigned)buf_bytes);
    return false;
  }

  host_fb = (lv_color_t *)calloc(SCREEN_W * SCREEN_H, sizeof(lv_color_t));
  if(host_fb == nullptr) {
    Serial.printf("[panel] FATAL: framebuffer alloc failed (%u B host heap)\n",
                  (unsigned)(SCREEN_W * SCREEN_H * sizeof(lv_color_t)));
    lvgl_panel_cleanup_host_allocations();
    return false;
  }

#if LVGL_PANEL_HAS_SDL
  if(!sdl_window_begin()) {
    lvgl_panel_cleanup_host_allocations();
    return false;
  }
#elif defined(EPOXY_DUINO)
  if(display_mode == LVGL_PANEL_DISPLAY_WINDOW) {
    Serial.println("[panel] window display mode unavailable: rebuild on a host with SDL2 headers installed");
    lvgl_panel_cleanup_host_allocations();
    return false;
  }
#endif

  return true;
}

void lvgl_panel_set_display_mode(LvglPanelDisplayMode mode)
{
  display_mode = mode;
}

LvglPanelDisplayMode lvgl_panel_get_display_mode()
{
  return display_mode;
}

const char *lvgl_panel_get_display_mode_name(LvglPanelDisplayMode mode)
{
  switch(mode) {
    case LVGL_PANEL_DISPLAY_WINDOW:
      return "window";
    case LVGL_PANEL_DISPLAY_HEADLESS:
    default:
      return "headless";
  }
}

void lvgl_panel_pump()
{
#if LVGL_PANEL_HAS_SDL
  if(display_mode != LVGL_PANEL_DISPLAY_WINDOW || sdl.handle == nullptr) {
    return;
  }

  SDL_Event event;
  while(sdl.PollEvent(&event)) {
    if(event.type == SDL_QUIT) {
      display_mode = LVGL_PANEL_DISPLAY_HEADLESS;
      unload_sdl();
      return;
    }
  }

  if(!sdl_window.dirty || host_fb == nullptr) {
    return;
  }

  if(sdl.UpdateTexture(sdl_window.texture, nullptr, host_fb, SCREEN_W * sizeof(lv_color_t)) != 0) {
    Serial.printf("[panel] SDL_UpdateTexture failed: %s\n", sdl.GetError ? sdl.GetError() : "unknown");
    display_mode = LVGL_PANEL_DISPLAY_HEADLESS;
    unload_sdl();
    return;
  }

  sdl.RenderClear(sdl_window.renderer);
  sdl.RenderCopy(sdl_window.renderer, sdl_window.texture, nullptr, nullptr);
  sdl.RenderPresent(sdl_window.renderer);
  sdl_window.dirty = false;
#else
  (void)0;
#endif
}

bool lvgl_panel_write_ppm(const char *path)
{
  if(host_fb == nullptr || path == nullptr || path[0] == '\0') {
    return false;
  }

