RAR/openevse_esp32_firmware/src/lvgl_tft/lvgl_panel.cpp
  FILE *fp = fopen(path, "wb");
  if(fp == nullptr) {
    return false;
  }

  fprintf(fp, "P6\n%u %u\n255\n", SCREEN_W, SCREEN_H);
  for(uint32_t i = 0; i < SCREEN_W * SCREEN_H; i++) {
    uint16_t px = host_fb[i].full;
    // RGB565 layout: RRRRRGGGGGGBBBBB. Expand each packed channel to 8-bit RGB.
    uint8_t rgb[3] = {
      (uint8_t)((((px >> 11) & 0x1F) * 255) / 31),
      (uint8_t)((((px >> 5)  & 0x3F) * 255) / 63),
      (uint8_t)(((px & 0x1F) * 255) / 31)
    };
    if(fwrite(rgb, sizeof(rgb), 1, fp) != 1) {
      fclose(fp);
      return false;
    }
  }
  fclose(fp);
  return true;
}

void lvgl_panel_set_backlight(uint8_t pct)
{
  (void)pct;
}

static void flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_p)
{
  if(host_fb) {
    int32_t x1 = area->x1 < 0 ? 0 : area->x1;
    int32_t y1 = area->y1 < 0 ? 0 : area->y1;
    int32_t x2 = area->x2 >= SCREEN_W ? SCREEN_W - 1 : area->x2;
    int32_t y2 = area->y2 >= SCREEN_H ? SCREEN_H - 1 : area->y2;
    int32_t area_w = area->x2 - area->x1 + 1;

    if(x1 <= x2 && y1 <= y2) {
      for(int32_t y = y1; y <= y2; y++) {
        const lv_color_t *src = color_p + (y - area->y1) * area_w + (x1 - area->x1);
        lv_color_t *dst = host_fb + y * SCREEN_W + x1;
        memcpy(dst, src, (x2 - x1 + 1) * sizeof(lv_color_t));
      }
    }
  }
#if LVGL_PANEL_HAS_SDL
  sdl_window.dirty = true;
#endif
  lv_disp_flush_ready(drv);
}

#else

static TFT_eSPI tft = TFT_eSPI();

static bool lvgl_panel_prepare_begin(size_t buf_bytes)
{
  tft.init();

#ifdef TFT_SPI_DRIVE_CAP
  // Bench experiment: weaken the SPI pad drive to slow the edges.
  //
  // At 80 MHz this panel garbles. Two candidate causes: reflections on ~70 mm
  // of board trace plus the flex, or the ILI9488 die simply not accepting a
  // serial write that fast (its cycle is specified around 50 ns / 20 MHz, so
  // even 40 MHz is already 2x spec). Weaker drive attacks only the first one.
  // If 80 MHz goes clean with slow edges the interconnect is the limit and
  // source-series termination is worth adding; if it stays garbled the panel
  // is the limit and no board change helps.
  //
  // Set after tft.init(): SPI.begin() runs the peripheral manager, which
  // reconfigures the pad and would discard anything set before it.
  gpio_set_drive_capability((gpio_num_t)TFT_SCLK, (gpio_drive_cap_t)TFT_SPI_DRIVE_CAP);
  gpio_set_drive_capability((gpio_num_t)TFT_MOSI, (gpio_drive_cap_t)TFT_SPI_DRIVE_CAP);
  gpio_set_drive_capability((gpio_num_t)TFT_DC,   (gpio_drive_cap_t)TFT_SPI_DRIVE_CAP);
  Serial.printf("[panel] SPI pad drive set to %d on SCLK/MOSI/DC\n", (int)TFT_SPI_DRIVE_CAP);
#endif

  tft.setRotation(1); // landscape, matches the original renderer
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcAttach(TFT_BL, LCD_BL_PWM_FREQ, LCD_BL_PWM_RES);
#else
  ledcSetup(LCD_BL_LEDC_CHANNEL, LCD_BL_PWM_FREQ, LCD_BL_PWM_RES);
  ledcAttachPin(TFT_BL, LCD_BL_LEDC_CHANNEL);
#endif
  // The backlight is independent of the LVGL draw buffer below, so it stays
  // usable even if that alloc fails and we return false — bl_ready is not cleared.
  bl_ready = true;
  lvgl_panel_set_backlight(100); // full on until LcdTask applies the configured level

#ifdef LCD_BL_PWM_SELFTEST
  // Gated diagnostic: ramp the backlight up/down a few times so a human can
  // confirm the panel actually dims (some BL circuits are on/off-only).
  // delay() is safe here: LVGL isn't running yet, and this is gated out of prod.
  for(int cycle = 0; cycle < 3; ++cycle) {
    for(int p = 0; p <= 100; p += 5) { lvgl_panel_set_backlight((uint8_t)p); delay(30); }
    for(int p = 100; p >= 0; p -= 5) { lvgl_panel_set_backlight((uint8_t)p); delay(30); }
  }
  lvgl_panel_set_backlight(100);
#endif

  lv_init();

  // MALLOC_CAP_INTERNAL is required, not a hint. On PSRAM boards a plain malloc()
  // of ~30 KB is over the SDK's 4096-byte ALWAYSINTERNAL threshold and would be
  // served from PSRAM -- which is exactly where the CPU-bound 3-byte-per-pixel
  // flush must not read from. The failure branch is a real boot-time mode, not a
  // formality: the SDK reserves no internal pool (SPIRAM_MALLOC_RESERVE_INTERNAL
  // is 0), so this competes with everything else on a fragmented heap. Keep the
  // largest-free-block report with it.
  buf1 = (lv_color_t *)heap_caps_malloc(buf_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if(buf1 == nullptr) {
    Serial.printf("[panel] FATAL: draw-buffer alloc failed (%u B internal); largest free block=%u\n",
                  (unsigned)buf_bytes,
                  (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL));
    return false;
  }

  return true;
}

void lvgl_panel_set_backlight(uint8_t pct)
{
  if(!bl_ready) {
    return;
  }
  uint8_t duty = bl_pct_to_duty(pct);
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(TFT_BL, duty);
#else
  ledcWrite(LCD_BL_LEDC_CHANNEL, duty);
#endif
}

// Convert a run of RGB565 pixels to the ILI9488's 18bpp wire format and push
// them in batches, instead of TFT_eSPI::pushPixels().
//
// The library's 18-bit pushPixels() is `while(len--) tft_Write_16(*data++)` --
// one whole SPI transaction per pixel, each programming mosi_dlen, writing the
// data register, setting cmd.usr and busy-waiting, all to move 24 bits. Measured
// on this board that is 4.48 us/px against 0.6 us of actual wire time at 40 MHz:
// 669 KB/s out of a 5 MB/s bus, and ~688 ms for a full screen. The library's
// non-18-bit path already batches into 512-bit FIFO writes; the 18-bit path
// never got the same treatment.
//
// SPIClass::writeBytes() does the chunked FIFO transfers for us, so the cost per
// pixel becomes the conversion plus a share of one transaction per chunk. A
// bigger buffer does not help once the per-transaction overhead is amortised
// over a couple of hundred pixels.
//
// The staging buffer is static, not on the stack. flush_cb() only ever runs on
// loopTask -- LVGL is driven from there -- so a single shared buffer is safe,
// and 768 B of BSS is the honest cost. On the stock TFT board the loop stack is
// 8 KB and already shared with Mongoose request handlers; quietly taking 768 B
// of it on a board that is in the field is not worth the cache locality.
static uint8_t push_buf[256 * 3];

static void push_pixels_batched(const uint16_t *src, uint32_t len)
{
  static const uint32_t CHUNK_PX = 256;          // 768 B staged per transfer
  uint8_t *buf = push_buf;

  SPIClass &spi = TFT_eSPI::getSPIinstance();

  while(len)
  {
    uint32_t n = (len < CHUNK_PX) ? len : CHUNK_PX;
    uint8_t *o = buf;
    for(uint32_t i = 0; i < n; i++)
    {
      // The draw buffer is byte-swapped: lv_conf.h sets LV_COLOR_16_SWAP=1 on
      // device, and TFT_eSPI's _swapBytes defaults to false, so pushPixels() was
      // taking its tft_Write_16S branch -- swap first, then extract. Reading the
      // halfword natively here scrambled every channel (inverted and grainy).
      uint16_t c = (uint16_t)((src[i] >> 8) | (src[i] << 8));
      // RGB565 -> RGB666, left-aligned in each byte exactly as tft_Write_16 does.
      *o++ = (uint8_t)((c & 0xF800) >> 8);
      *o++ = (uint8_t)((c & 0x07E0) >> 3);
      *o++ = (uint8_t)((c & 0x001F) << 3);
    }
    spi.writeBytes(buf, n * 3);
    src += n;
    len -= n;
  }
}

#ifdef LVGL_FLUSH_PROFILE
#include "debug.h"   // route the report through StreamSpy so /debug/console sees it
// Bench instrumentation for the display link, off unless -D LVGL_FLUSH_PROFILE.
//
// It splits the time inside pushPixels() -- the bytes actually clocked out, plus
// the CPU-side RGB565->RGB666 conversion this panel forces -- from the
// setAddrWindow()/startWrite() overhead around it. That is the measurement that
// says which lever is worth pulling: if push_us is close to the theoretical bus
// time for the bytes at SPI_FREQUENCY, the link is saturated and a clock bump is
// the answer; if it is well above, the per-pixel conversion dominates and the
// fix is esp_lcd, which converts and DMAs instead.
static uint32_t prof_flushes = 0;
static uint32_t prof_px      = 0;
static uint32_t prof_push_us = 0;
static uint32_t prof_win_us  = 0;
static uint32_t prof_last_report = 0;

