RAR/openevse_esp32_firmware/src/lvgl_tft/lvgl_panel.cpp
static void flush_profile_report()
{
  uint32_t now = millis();
  if(prof_last_report != 0 && (now - prof_last_report) < 2000) {
    return;
  }
  prof_last_report = now;
  if(0 == prof_flushes || 0 == prof_px) {
    return;
  }

  // 3 bytes/pixel on the wire: this panel is 18bpp over SPI, RGB565 is not an
  // option. A "frame" here is one full screen's worth of pixels, whether or not
  // any single flush covered that much -- LVGL only ever flushes dirty areas.
  uint32_t bytes   = prof_px * 3;
  uint32_t total_us = prof_push_us + prof_win_us;
  uint32_t kbps    = prof_push_us ? (uint32_t)(((uint64_t)bytes * 1000ULL) / prof_push_us) : 0;
  uint32_t frame_ms = (uint32_t)(((uint64_t)total_us * SCREEN_W * SCREEN_H) / ((uint64_t)prof_px * 1000ULL));

  DBUGF("[lvgl] %lu flushes, %lu px, push %lu us, win %lu us, %lu KB/s, full frame ~%lu ms (~%lu fps) @ %d Hz",
        (unsigned long)prof_flushes, (unsigned long)prof_px,
        (unsigned long)prof_push_us, (unsigned long)prof_win_us,
        (unsigned long)kbps, (unsigned long)frame_ms,
        (unsigned long)(frame_ms ? 1000 / frame_ms : 0), (int)SPI_FREQUENCY);

  prof_flushes = 0; prof_px = 0; prof_push_us = 0; prof_win_us = 0;
}
#endif

static void flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_p)
{
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);

#ifdef LVGL_FLUSH_PROFILE
  uint32_t t0 = micros();
#endif
  tft.startWrite();
  tft.setAddrWindow(area->x1, area->y1, w, h);
#ifdef LVGL_FLUSH_PROFILE
  uint32_t t1 = micros();
#endif
  push_pixels_batched((uint16_t *)&color_p->full, w * h);
#ifdef LVGL_FLUSH_PROFILE
  uint32_t t2 = micros();
#endif
  tft.endWrite();

#ifdef LVGL_FLUSH_PROFILE
  prof_flushes++;
  prof_px      += w * h;
  prof_win_us  += (t1 - t0);
  prof_push_us += (t2 - t1);
  flush_profile_report();
#endif

  lv_disp_flush_ready(drv);
}

#endif

#if defined(LVGL_TASK) && !defined(EPOXY_DUINO)

// Cadence of the LVGL task when it has nothing to draw. LVGL's own refresh
// period (LV_DISP_DEF_REFR_PERIOD, 30 ms) decides when a render actually
// happens; this only bounds how soon the task notices.
#ifndef LVGL_TASK_TICK_MS
#define LVGL_TASK_TICK_MS 5
#endif
// Core 1 runs loopTask, core 0 runs the WiFi/lwIP stack. Neither is free, but
// core 0 is the idler of the two in this firmware and keeping the panel off
// loopTask's core is the entire point.
#ifndef LVGL_TASK_CORE
#define LVGL_TASK_CORE 0
#endif
#ifndef LVGL_TASK_STACK
#define LVGL_TASK_STACK 6144
#endif
// Below loopTask (which Arduino runs at 1) would let a busy loopTask starve the
// display; above it would let the display stall the app. Equal means they
// round-robin, and they are on different cores anyway.
#ifndef LVGL_TASK_PRIO
#define LVGL_TASK_PRIO 1
#endif

static SemaphoreHandle_t lvgl_mutex = nullptr;

bool lvgl_lock()
{
  if(lvgl_mutex == nullptr) {
    return false;
  }
  xSemaphoreTakeRecursive(lvgl_mutex, portMAX_DELAY);
  return true;
}

void lvgl_unlock()
{
  if(lvgl_mutex != nullptr) {
    xSemaphoreGiveRecursive(lvgl_mutex);
  }
}

static void lvgl_task(void *)
{
  for(;;) {
    // Held across the render AND the flush: the flush reads the draw buffer
    // that the render just filled, and nothing else may touch LVGL meanwhile.
    lvgl_lock();
    uint32_t next = lv_timer_handler();
    lvgl_unlock();

    // lv_timer_handler() returns how long it is happy to wait. Cap it so a
    // screen built from another task is picked up promptly, and floor it at one
    // tick so this never spins.
    if(next > 100) { next = 100; }
    vTaskDelay(pdMS_TO_TICKS(next < LVGL_TASK_TICK_MS ? LVGL_TASK_TICK_MS : next));
  }
}

#endif // LVGL_TASK && !EPOXY_DUINO

bool lvgl_panel_begin()
{
  const size_t buf_bytes = DRAW_BUF_PIXELS * sizeof(lv_color_t);

  if(!lvgl_panel_prepare_begin(buf_bytes)) {
    return false;
  }

  lv_disp_draw_buf_init(&draw_buf, buf1, nullptr, DRAW_BUF_PIXELS);

  lv_disp_drv_init(&disp_drv);
  disp_drv.hor_res = SCREEN_W;
  disp_drv.ver_res = SCREEN_H;
  disp_drv.flush_cb = flush_cb;
  disp_drv.draw_buf = &draw_buf;
  lv_disp_drv_register(&disp_drv);

#if defined(LVGL_TASK) && !defined(EPOXY_DUINO)
  // Created AFTER the display is registered: the task calls lv_timer_handler()
  // immediately and that walks the display list.
  lvgl_mutex = xSemaphoreCreateRecursiveMutex();
  if(lvgl_mutex == nullptr ||
     pdPASS != xTaskCreatePinnedToCore(lvgl_task, "lvgl", LVGL_TASK_STACK, nullptr,
                                       LVGL_TASK_PRIO, nullptr, LVGL_TASK_CORE)) {
    // Fail loudly rather than silently: with no task, nothing pumps LVGL and
    // the panel would simply never update. lvgl_lock() tolerates a null mutex,
    // so the caller's own pump (if it has one) still works.
    Serial.println("[panel] FATAL: LVGL task would not start; display will not refresh");
    if(lvgl_mutex != nullptr) { vSemaphoreDelete(lvgl_mutex); lvgl_mutex = nullptr; }
    return false;
  }
  Serial.printf("[panel] LVGL task on core %d, prio %d\n",
                (int)LVGL_TASK_CORE, (int)LVGL_TASK_PRIO);
#endif

#if defined(EPOXY_DUINO)
  Serial.printf("[panel] %s LVGL display up %ux%u, 1 buf %u B host heap\n",
                lvgl_panel_get_display_mode_name(display_mode),
                SCREEN_W, SCREEN_H, (unsigned)buf_bytes);
#else
  Serial.printf("[panel] display up %ux%u, 1 buf %u B internal, free internal heap=%u\n",
                SCREEN_W, SCREEN_H, (unsigned)buf_bytes,
                (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
#endif
  return true;
}

#endif // ENABLE_SCREEN_LVGL_TFT
